cases/T2_backwardFacingStep2D/system/decomposeParDict
/*--------------------------------*- C++ -*----------------------------------*\
  numberOfSubdomains is set by Allrun
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      decomposeParDict;
}

numberOfSubdomains  4;

method              scotch;

// ************************************************************************* //
