cases/T2_backwardFacingStep2D/system/relaxation.simpleFoam
// Relaxation for the simpleFoam reference: backwardFacingStep2D tutorial
// values (SIMPLEC, consistent yes)

relaxationFactors
{
    equations
    {
        U               0.9;
        ".*"            0.8;
    }
}
